{
    "solver system prompt" : "***\nYou are an intelligent math assistant specializing in solving mathematical equations presented in LaTeX format. Your primary task is to interpret, solve, and provide a clear, step-by-step explanation for any mathematical problem or equation. You will: \n Accurately parse LaTeX equations. \n Solve the equation or mathematical problem. \n Break down the solution process into easy-to-follow steps. \n Provide explanations for each step to ensure clarity for users at any skill level. \n Focus on accuracy, clarity, and comprehensiveness in both solving problems and explaining them.",

    "classifier system prompt" : "You are a highly specialized assistant designed to analyze mathematical queries and categorize them into specific topics related to various areas of mathematics. When a user inputs a query, your job is to determine the most appropriate category from the list below. You should only output the name of the category (or categories) that best fits the query, based on the mathematical concepts involved. Be precise and base your decision on the content of the input.\nCategories:\n\n    Primes, Highest Common Factor, and Lowest Common Multiple: Concepts related to prime numbers, factors, divisibility, and methods for finding the HCF or LCM.\n    Integers, Rational Numbers, and Real Numbers: Classification of numbers into whole numbers, fractions, decimals, and their properties.\n    Basic Algebra and Algebraic Manipulation: Simplifying expressions, solving equations, and performing operations on algebraic terms.\n    Linear Equations and Simple Inequalities: Solving linear equations or inequalities in one variable.\n    Number Patterns: Recognizing and analyzing arithmetic or geometric sequences, or other number patterns.\n    Percentage: Problems involving percentage calculations, percentage change, and real-world percentage applications.\n    Ratio, Rate, Time, and Speed: Solving problems related to proportions, ratios, time-speed relationships, and rates.\n    Direct and Inverse Proportions: Identifying and solving problems involving direct or inverse proportionality.\n    Linear Graphs and Simultaneous Linear Equations: Plotting and interpreting linear graphs, and solving systems of linear equations.\n    Expansion and Factorisation of Quadratic Expressions: Expanding or factorizing quadratic expressions, using methods such as completing the square or using the quadratic formula.\n    Further Expansion and Factorisation of Algebraic Expressions: More complex factorization techniques involving polynomials or higher-order algebraic expressions.\n    Quadratic Equations and Graphs: Solving quadratic equations and interpreting their graphical representations.\n    Algebraic Fractions and Formulae: Manipulating algebraic fractions, rearranging and solving formulas.\n    Quadratic Equations and Functions: Solving and analyzing quadratic equations, including transformations and interpretations of quadratic functions.\n    Linear Inequalities: Handling inequalities involving linear expressions and interpreting the solution sets.\n    Indices and Standard Form: Problems involving powers, roots, exponential expressions, and standard form notation.\n\nWhen you receive an input, categorize it accurately and select only the most relevant category or categories. If the input is ambiguous or covers multiple topics, you may choose multiple categories.",

    "HCF,Prime and LCM" : "\n# Primes, Highest Common Factor, and Lowest Common Multiple\n\n### 1. Prime Numbers\n\n#### Definition:\nA **prime number** is a natural number greater than 1 that has no positive divisors other than 1 and itself.\n\n#### Examples:\n- \\( 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, \\dots \\)\n- The number 2 is the smallest prime and the only even prime number.\n\n#### Non-prime (Composite) Numbers:\n- A composite number has more than two positive divisors.\n- Example: \\( 4 \\) is composite since its divisors are \\( 1, 2, 4 \\).\n\n#### How to Test for Primality:\nTo check if a number \\( n \\) is prime:\n1. Check if it is divisible by any prime numbers less than or equal to \\( \\sqrt{n} \\).\n2. If no such divisor exists, the number is prime.\n\n---\n\n### 2. Prime Factorization\n\n#### Definition:\nPrime factorization is the process of expressing a composite number as a product of its prime factors.\n\n#### Method:\n1. Start dividing the number by the smallest prime (i.e., 2) and continue until the quotient is no longer divisible by that prime.\n2. Move to the next smallest prime and repeat until you reach 1.\n\n#### Example:\nFind the prime factorization of \\( 60 \\).\n\n\\[\n60 \\div 2 = 30 \\quad \\Rightarrow \\quad 30 \\div 2 = 15 \\quad \\Rightarrow \\quad 15 \\div 3 = 5 \\quad \\Rightarrow \\quad 5 \\div 5 = 1\n\\]\n\nThus, the prime factorization of \\( 60 \\) is:\n\\[\n60 = 2^2 \\times 3 \\times 5\n\\]\n\n---\n\n### 3. Square Roots and Cube Roots\n\n#### Square Root:\nThe square root of a number \\( n \\) is the value that, when multiplied by itself, gives \\( n \\).\n\n- Symbol: \\( \\sqrt{n} \\)\n- Example:\n  \\[\n  \\sqrt{16} = 4 \\quad \\text{since} \\quad 4 \\times 4 = 16\n  \\]\n\n#### Cube Root:\nThe cube root of a number \\( n \\) is the value that, when multiplied by itself twice, gives \\( n \\).\n\n- Symbol: \\( \\sqrt[3]{n} \\)\n- Example:\n  \\[\n  \\sqrt[3]{27} = 3 \\quad \\text{since} \\quad 3 \\times 3 \\times 3 = 27\n  \\]\n\n#### Perfect Squares and Perfect Cubes:\n- **Perfect Square**: A number that is the square of an integer.\n  \\[\n  1, 4, 9, 16, 25, \\dots\n  \\]\n- **Perfect Cube**: A number that is the cube of an integer.\n  \\[\n  1, 8, 27, 64, 125, \\dots\n  \\]\n\n---\n\n### 4. Highest Common Factor (HCF) and Lowest Common Multiple (LCM)\n\n#### Highest Common Factor (HCF):\nThe **HCF** of two or more numbers is the largest number that divides all of them without leaving a remainder.\n\n#### Method for Finding HCF:\n1. **Prime Factorization**: Write the prime factorizations of the numbers.\n2. **Common Factors**: Identify the common prime factors and select the lowest powers of these primes.\n3. **Multiply**: Multiply the lowest powers of the common primes to get the HCF.\n\n#### Example:\nFind the HCF of \\( 36 \\) and \\( 48 \\).\n\\[\n36 = 2^2 \\times 3^2, \\quad 48 = 2^4 \\times 3\n\\]\nCommon factors: \\( 2^2 \\times 3 \\)\n\n\\[\n\\text{HCF} = 2^2 \\times 3 = 12\n\\]\n\n#### Lowest Common Multiple (LCM):\nThe **LCM** of two or more numbers is the smallest number that is a multiple of all of them.\n\n#### Method for Finding LCM:\n1. **Prime Factorization**: Write the prime factorizations of the numbers.\n2. **All Factors**: Take all prime factors, using the highest powers of the primes.\n3. **Multiply**: Multiply the highest powers of the primes to get the LCM.\n\n#### Example:\nFind the LCM of \\( 36 \\) and \\( 48 \\).\n\\[\n36 = 2^2 \\times 3^2, \\quad 48 = 2^4 \\times 3\n\\]\nLCM is \\( 2^4 \\times 3^2 \\):\n\n\\[\n\\text{LCM} = 16 \\times 9 = 144\n\\]\n\n#### Relationship between HCF and LCM:\nFor two numbers \\( a \\) and \\( b \\), the product of the HCF and LCM is equal to the product of the numbers:\n\\[\n\\text{HCF}(a, b) \\times \\text{LCM}(a, b) = a \\times b\n\\]\n\n#### Example:\nFor \\( 36 \\) and \\( 48 \\):\n\\[\n\\text{HCF}(36, 48) = 12, \\quad \\text{LCM}(36, 48) = 144\n\\]\n\\[\n12 \\times 144 = 36 \\times 48 = 1728\n\\]\n\n---\n\n### Summary\n\n- **Prime numbers** are numbers with exactly two distinct divisors: 1 and the number itself.\n- **Prime factorization** expresses a number as a product of prime factors.\n- **Square roots** and **cube roots** are operations to find numbers that, when squared or cubed, result in the original number.\n- The **HCF** of two numbers is the largest factor they share, while the **LCM** is the smallest multiple they both share.\n\n---\n\nThese notes should provide a comprehensive understanding of the concepts. Let me know if you'd like to add more examples or explanations!",

    "Basic Algebra and Algebraic Manipulation" : "Basic Algebra and Algebraic Manipulation\n1. Fundamental Algebra\nVariables and Constants:\n\n    Variable: A symbol, usually a letter, that represents an unknown number. Example: x,y,zx,y,z.\n    Constant: A fixed value. Example: 5,−3,125,−3,21​.\n\nAlgebraic Expressions:\n\nAn algebraic expression consists of variables, constants, and operations (like addition, subtraction, multiplication, and division).\n\n    Example: 3x+53x+5 is an expression where 3x3x and 55 are terms.\n    Terms are separated by addition or subtraction signs.\n\nEvaluating Expressions:\n\nTo evaluate an expression, substitute the value of the variable(s) and simplify.\n\n    Example: For 3x+53x+5 when x=2x=2:\n    3(2)+5=6+5=11\n    3(2)+5=6+5=11\n\n2. Expansion and Simplification of Linear Expressions\n\nExpansion is the process of removing brackets by distributing multiplication over addition or subtraction.\nExpanding Linear Expressions:\n\n    Use the distributive property: a(b+c)=ab+aca(b+c)=ab+ac.\n    For multiple terms inside parentheses, multiply each term by the factor outside.\n\nExamples:\n\n    Expand 3(x+4)3(x+4):\n    3(x+4)=3⋅x+3⋅4=3x+12\n    3(x+4)=3⋅x+3⋅4=3x+12\n\n    Expand 5(a−2)5(a−2):\n    5(a−2)=5⋅a−5⋅2=5a−10\n    5(a−2)=5⋅a−5⋅2=5a−10\n\nSimplification:\n\nCombine like terms (terms with the same variable and power) to simplify the expression.\n\n    Example: Simplify 4x+3−2x+54x+3−2x+5:\n    4x−2x+3+5=2x+8\n    4x−2x+3+5=2x+8\n\n3. Simplification of Linear Expressions with Fractional Coefficients\n\nWhen simplifying expressions with fractions, follow these steps:\n\n    Expand if necessary.\n    Combine like terms, including fractional coefficients.\n    Convert to a common denominator for terms with fractional coefficients, if needed.\n\nExamples:\n\n    Simplify 12x+34x21​x+43​x:\n    12x+34x=24x+34x=54x\n    21​x+43​x=42​x+43​x=45​x\n\n    Simplify 3(23y+12)3(32​y+21​):\n    3(23y+12)=3⋅23y+3⋅12=2y+32\n    3(32​y+21​)=3⋅32​y+3⋅21​=2y+23​\n\n4. Factorisation\n\nFactorisation is the process of expressing an expression as a product of its factors.\nCommon Factor:\n\n    Find the highest common factor (HCF) of the terms.\n    Factor out the HCF.\n\nExample:\n\n    Factorise 4x+84x+8:\n        The HCF of 4x4x and 88 is 44.\n        Factor out 44:\n        4x+8=4(x+2)\n        4x+8=4(x+2)\n\nFactorising by Grouping:\n\n    Group terms that have a common factor.\n    Factor out the common factor from each group.\n    If both groups contain a common binomial, factor it out.\n\nExample:\n\n    Factorise x(y+2)+3(y+2)x(y+2)+3(y+2):\n        Common factor: y+2y+2.\n        Factor out y+2y+2:\n        x(y+2)+3(y+2)=(y+2)(x+3)\n        x(y+2)+3(y+2)=(y+2)(x+3)\n\nSummary\n\n    Fundamental Algebra: Basic components include variables, constants, and terms.\n    Expansion: Use the distributive property to remove brackets.\n    Simplification: Combine like terms, including those with fractional coefficients.\n    Factorisation: Express expressions as products using common factors or grouping.",

    "Linear Equations and Simple Inequalities" : "1. Linear Equations\nDefinition\n\nA linear equation is an algebraic equation in which each term is either a constant or the product of a constant and a single variable. Linear equations are of the first degree, meaning the highest power of the variable is 1.\nGeneral Form\n\nThe general form of a linear equation in one variable xx is:\nax+b=0\nax+b=0\n\nwhere aa and bb are constants, and a≠0a=0.\n\nIn two variables xx and yy, the general form of a linear equation is:\nax+by=c\nax+by=c\n\nwhere aa, bb, and cc are constants, and at least one of aa or bb is non-zero.\nSolving Linear Equations\n\nTo solve a linear equation, we isolate the variable by performing operations that keep the equation balanced. Here’s a step-by-step approach:\n\n    Simplify each side: Use the distributive property to expand terms and combine like terms.\n    Isolate the variable: Use addition or subtraction to move constants and terms containing the variable to opposite sides of the equation.\n    Solve for the variable: Divide or multiply to find the value of the variable.\n\nExample\n\nSolve 3x−4=113x−4=11.\n\nSolution:\n3x−4=11\n3x−4=11\n\nAdd 4 to both sides:\n3x=15\n3x=15\n\nDivide both sides by 3:\nx=5\nx=5\n2. Formulae\nDefinition\n\nA formula is an equation that shows the relationship between different variables. Formulae are widely used to represent scientific and mathematical relationships and to solve problems efficiently.\nCommon Examples\n\n    Distance Formula: d=rtd=rt, where dd is distance, rr is rate (or speed), and tt is time.\n    Area of a Rectangle: A=lwA=lw, where AA is the area, ll is length, and ww is width.\n    Simple Interest Formula: I=PrtI=Prt, where II is interest, PP is principal, rr is the rate of interest, and tt is time.\n\nUsing Formulae\n\nTo use a formula:\n\n    Identify known values: Determine which variables have known values.\n    Substitute values: Substitute the known values into the formula.\n    Solve for the unknown: Perform arithmetic operations to find the value of the unknown variable.\n\nExample\n\nFind the area of a rectangle with length 88 cm and width 55 cm.\n\nSolution:\nA=lw=8×5=40 cm2\nA=lw=8×5=40cm2\n3. Applications of Linear Equations in Real-World Contexts\n\nLinear equations are useful for solving practical problems in various real-world contexts, such as finance, business, science, and everyday situations.\nExamples of Applications\n\n    Budgeting: Calculating expenses given a fixed income.\n        For example, if a person earns $300 per week and spends $50 on food and $100 on rent, a linear equation can model their remaining weekly budget.\n    Distance, Speed, and Time: Calculating travel time, distance, or speed.\n        Example: If a car travels at a speed of 60 km/h, how far will it go in 3 hours? Using the formula d=rtd=rt, we find d=60×3=180d=60×3=180 km.\n    Chemistry: Solving for concentration or volume in solutions.\n        If 10 liters of a 5% solution is mixed with 20 liters of a 10% solution, linear equations can help determine the concentration of the resulting solution.\n\n4. Simple Inequalities\nDefinition\n\nAn inequality is a mathematical statement that compares two expressions using inequality symbols:\n\n    Less than (<<)\n    Greater than (>>)\n    Less than or equal to (≤≤)\n    Greater than or equal to (≥≥)\n\nTypes of Inequalities\n\n    Linear Inequalities in One Variable: These are inequalities that involve only one variable, typically in the form ax+b<cax+b<c or ax+b≥cax+b≥c.\n    Linear Inequalities in Two Variables: These involve two variables, commonly represented as ax+by≤cax+by≤c.\n\nSolving Simple Inequalities\n\nTo solve an inequality, follow steps similar to solving equations but with special attention to inequality rules. Key points to remember:\n\n    When adding or subtracting a number from both sides, the direction of the inequality remains the same.\n    When multiplying or dividing by a positive number, the inequality direction remains the same.\n    When multiplying or dividing by a negative number, the inequality direction reverses.\n\nExample\n\nSolve 2x+3<112x+3<11.\n\nSolution:\n2x+3<11\n2x+3<11\n\nSubtract 3 from both sides:\n2x<8\n2x<8\n\nDivide by 2:\nx<4\nx<4\nGraphing Inequalities\n\nFor inequalities in one variable, solutions can be represented on a number line:\n\n    Open circle (∘∘) for inequalities without “or equal to” (e.g., x<4x<4)\n    Closed circle (∙∙) for inequalities with “or equal to” (e.g., x≤4x≤4)\n\nFor inequalities in two variables, solutions are often shaded regions on a coordinate plane, bounded by the line of the equality form (e.g., ax+by=cax+by=c).",

    "Expansion and Factorisation of Quadratic Expressions" : "1. Quadratic Expressions\nDefinition\n\nA quadratic expression is an algebraic expression in which the highest power of the variable is 2. Quadratic expressions typically take the form:\nax2+bx+c\nax2+bx+c\n\nwhere aa, bb, and cc are constants, and a≠0a=0. The variable xx is raised to the second power, which makes the expression quadratic.\nExamples of Quadratic Expressions\n\n    x2+5x+6x2+5x+6\n    2x2−3x+12x2−3x+1\n    −4x2+7−4x2+7\n\nQuadratic expressions are foundational in solving quadratic equations and graphing parabolas, and they frequently appear in real-world contexts involving areas, projectile motion, and optimization.\n2. Expansion and Simplification of Quadratic Expressions\nExpansion\n\nExpanding a quadratic expression involves using the distributive property or the FOIL method (First, Outer, Inner, Last) when multiplying two binomials. This expansion is essential for transforming expressions from a factored form into a standard quadratic form ax2+bx+cax2+bx+c.\nExamples of Expansion\n\n    Expanding (x+3)(x+2)(x+3)(x+2):\n        Using FOIL:\n            First: x⋅x=x2x⋅x=x2\n            Outer: x⋅2=2xx⋅2=2x\n            Inner: 3⋅x=3x3⋅x=3x\n            Last: 3⋅2=63⋅2=6\n        Combine terms:\n        x2+2x+3x+6=x2+5x+6\n        x2+2x+3x+6=x2+5x+6\n\n    Expanding (2x−1)(x+4)(2x−1)(x+4):\n        Using FOIL:\n            First: 2x⋅x=2x22x⋅x=2x2\n            Outer: 2x⋅4=8x2x⋅4=8x\n            Inner: −1⋅x=−x−1⋅x=−x\n            Last: −1⋅4=−4−1⋅4=−4\n        Combine terms:\n        2x2+8x−x−4=2x2+7x−4\n        2x2+8x−x−4=2x2+7x−4\n\nSimplification\n\nAfter expansion, the expression should be simplified by combining like terms. This step often involves adding or subtracting the linear terms or constants.\nExample of Simplification\n\nExpand and simplify (x+2)(x−3)(x+2)(x−3):\n\n    Expand:\n    x2−3x+2x−6\n    x2−3x+2x−6\n    Combine like terms:\n    x2−x−6\n    x2−x−6\n\n3. Factorisation of Quadratic Expressions\nFactorisation\n\nFactorisation is the process of expressing a quadratic expression as a product of two binomials. It is the reverse of expansion and is especially useful for solving quadratic equations.\nMethods for Factorising Quadratic Expressions\n\n    Simple Quadratic Factorisation: For expressions of the form x2+bx+cx2+bx+c, find two numbers that multiply to cc and add to bb.\n        Example: Factorise x2+5x+6x2+5x+6.\n            Find two numbers that multiply to 6 and add to 5: 22 and 33.\n            Rewrite as:\n            (x+2)(x+3)\n            (x+2)(x+3)\n\n    Factorising Quadratics with a Leading Coefficient: For expressions of the form ax2+bx+cax2+bx+c where a≠1a=1, use trial and error or the grouping method.\n        Example: Factorise 2x2+7x+32x2+7x+3.\n            Find two numbers that multiply to 2×3=62×3=6 and add to 77: 66 and 11.\n            Rewrite as:\n            2x2+6x+x+3\n            2x2+6x+x+3\n            Group terms and factor out common factors:\n            =2x(x+3)+1(x+3)\n            =2x(x+3)+1(x+3)\n            Factor by grouping:\n            =(2x+1)(x+3)\n            =(2x+1)(x+3)\n\n    Perfect Square Trinomials: A quadratic expression like a2+2ab+b2a2+2ab+b2 can be factored as (a+b)2(a+b)2.\n        Example: Factorise x2+6x+9x2+6x+9.\n            Recognize that 9=329=32 and 6x=2⋅x⋅36x=2⋅x⋅3.\n            Rewrite as:\n            (x+3)2\n            (x+3)2\n\n    Difference of Squares: For expressions like a2−b2a2−b2, factor as (a+b)(a−b)(a+b)(a−b).\n        Example: Factorise x2−9x2−9.\n            Recognize 9=329=32.\n            Rewrite as:\n            (x+3)(x−3)\n            (x+3)(x−3)\n\nSummary of Factorisation Techniques\n\n    Identify the structure of the quadratic expression (simple quadratic, perfect square, or difference of squares).\n    Apply the appropriate factorisation technique based on the structure.\n    Verify by expanding the factors to ensure they result in the original expression.",
    
    "Further Expansion and Factorisation of Algebraic Expressions" : "Further Expansion and Factorisation of Algebraic Expressions\n1. Expansion and Factorisation of Algebraic Expressions\nExpansion\n\nExpansion involves distributing and combining like terms in an algebraic expression. This process transforms products into sums or differences. To expand an expression, apply the distributive property (also known as the distributive law).\nExample of Expansion\n\nExpand 3(x+4)−2(2x−5)3(x+4)−2(2x−5):\n\n    Distribute 33 and −2−2:\n    3x+12−4x+10\n    3x+12−4x+10\n    Combine like terms:\n    −x+22\n    −x+22\n\nFactorisation\n\nFactorisation is the process of expressing an algebraic expression as a product of its factors. This is the reverse operation of expansion. Factorisation helps simplify expressions and solve equations.\nExample of Factorisation\n\nFactorise x2+5x+6x2+5x+6:\n\n    Identify factors of 66 that add up to 55: 22 and 33.\n    Write in factored form:\n    (x+2)(x+3)\n    (x+2)(x+3)\n\n2. Expansion Using Special Algebraic Identities\n\nSpecial algebraic identities are specific formulas that simplify the expansion of certain polynomial expressions.\nCommon Special Algebraic Identities\n\n    Square of a Binomial:\n        (a+b)2=a2+2ab+b2(a+b)2=a2+2ab+b2\n        (a−b)2=a2−2ab+b2(a−b)2=a2−2ab+b2\n\n    Product of a Sum and a Difference:\n        (a+b)(a−b)=a2−b2(a+b)(a−b)=a2−b2\n\n    Cube of a Binomial:\n        (a+b)3=a3+3a2b+3ab2+b3(a+b)3=a3+3a2b+3ab2+b3\n        (a−b)3=a3−3a2b+3ab2−b3(a−b)3=a3−3a2b+3ab2−b3\n\nExample of Expansion Using Identities\n\nExpand (x+2)2(x+2)2:\n\n    Apply the identity:\n    (x+2)2=x2+2⋅x⋅2+22=x2+4x+4\n    (x+2)2=x2+2⋅x⋅2+22=x2+4x+4\n\nExpand (x−3)(x+3)(x−3)(x+3):\n\n    Apply the difference of squares identity:\n    (x−3)(x+3)=x2−9\n    (x−3)(x+3)=x2−9\n\n3. Factorisation Using Special Algebraic Identities\n\nFactorisation can also leverage special algebraic identities to simplify the process.\nExample of Factorisation Using Identities\n\n    Factoring the Square of a Binomial:\n        From a2+2ab+b2a2+2ab+b2, factor to (a+b)2(a+b)2.\n        Example: Factor x2+10x+25x2+10x+25:\n        x2+10x+25=(x+5)2\n        x2+10x+25=(x+5)2\n\n    Factoring the Difference of Squares:\n        From a2−b2a2−b2, factor to (a+b)(a−b)(a+b)(a−b).\n        Example: Factor x2−16x2−16:\n        x2−16=(x+4)(x−4)\n        x2−16=(x+4)(x−4)\n\n4. Factorisation by Grouping\n\nFactorisation by grouping is a technique used when an expression has four or more terms. The goal is to group terms in pairs, factor out the common factor from each group, and then factor out the common binomial factor.\nSteps for Factorisation by Grouping\n\n    Group the terms in pairs.\n    Factor out the common factor from each pair.\n    Factor out the common binomial factor.\n\nExample of Factorisation by Grouping\n\nFactorise ax+ay+bx+byax+ay+bx+by:\n\n    Group:\n    (ax+ay)+(bx+by)\n    (ax+ay)+(bx+by)\n    Factor out the common factors:\n    a(x+y)+b(x+y)\n    a(x+y)+b(x+y)\n    Factor out the common binomial:\n    (x+y)(a+b)\n    (x+y)(a+b)\n\nAnother Example: Factorise x3+3x2+2x+6x3+3x2+2x+6:\n\n    Group:\n    (x3+3x2)+(2x+6)\n    (x3+3x2)+(2x+6)\n    Factor out common factors:\n    x2(x+3)+2(x+3)\n    x2(x+3)+2(x+3)\n    Factor out the common binomial:\n    (x+3)(x2+2)\n    (x+3)(x2+2)",

    "Algebraic Fractions and Formulae" : "Here are the notes on Algebraic Fractions and Formulae, with explanations and examples to guide students through each concept.\nAlgebraic Fractions and Formulae\n1. Algebraic Fractions\nDefinition:\n\nAn algebraic fraction is a fraction that includes variables in the numerator, the denominator, or both.\nSimplifying Algebraic Fractions:\n\nTo simplify an algebraic fraction:\n\n    Factor the numerator and denominator completely.\n    Cancel out any common factors.\n\nExample:\n\nSimplify 6x23x3x6x2​:\n6x23x=6⋅x⋅x3⋅x=2x1=2x\n3x6x2​=3⋅x6⋅x⋅x​=12x​=2x\n2. Multiplication and Division of Algebraic Fractions\nMultiplication:\n\nTo multiply algebraic fractions:\n\n    Multiply the numerators together.\n    Multiply the denominators together.\n    Simplify the result by canceling common factors.\n\nExample:\n\nMultiply 2x5×34x52x​×4x3​:\n2x⋅35⋅4x=6x20x=620=310\n5⋅4x2x⋅3​=20x6x​=206​=103​\nDivision:\n\nTo divide algebraic fractions:\n\n    Multiply by the reciprocal of the second fraction.\n    Simplify if possible.\n\nExample:\n\nDivide 5x3÷109x35x​÷9x10​:\n5x3×9x10=5⋅9⋅x⋅x3⋅10=45x230=3x22\n35x​×109x​=3⋅105⋅9⋅x⋅x​=3045x2​=23x2​\n3. Addition and Subtraction of Algebraic Fractions\n\nTo add or subtract algebraic fractions:\n\n    Find a common denominator.\n    Rewrite each fraction with the common denominator.\n    Add or subtract the numerators.\n    Simplify if possible.\n\nExample:\n\nAdd 2x3+3x432x​+43x​:\n\n    The common denominator is 1212.\n    Rewrite each fraction:\n    2x3=8x12,3x4=9x12\n    32x​=128x​,43x​=129x​\n    Add the numerators:\n    8x+9x12=17x12\n    128x+9x​=1217x​\n\nExample:\n\nSubtract 5y6−y465y​−4y​:\n\n    The common denominator is 1212.\n    Rewrite each fraction:\n    5y6=10y12,y4=3y12\n    65y​=1210y​,4y​=123y​\n    Subtract the numerators:\n    10y−3y12=7y12\n    1210y−3y​=127y​\n\n4. Manipulation of Algebraic Formulae\n\nManipulating formulae involves rearranging a formula to make one of the variables the subject. This process often involves:\n\n    Adding, subtracting, multiplying, or dividing both sides of the equation to isolate the desired variable.\n    Using algebraic operations to simplify and solve for the new subject.\n\nSteps:\n\n    Identify the subject (the variable to isolate).\n    Perform inverse operations step-by-step to isolate the subject.\n\nExample:\n\nMake xx the subject in y=3x+5y=3x+5:\n\n    Subtract 55 from both sides:\n    y−5=3x\n    y−5=3x\n    Divide both sides by 33:\n    x=y−53\n    x=3y−5​\n\nExample:\n\nMake tt the subject in s=ut+12at2s=ut+21​at2:\n\n    Move utut to the left side:\n    s−ut=12at2\n    s−ut=21​at2\n    Multiply both sides by 22:\n    2(s−ut)=at2\n    2(s−ut)=at2\n    Divide by aa:\n    t2=2(s−ut)a\n    t2=a2(s−ut)​\n    Take the square root:\n    t=2(s−ut)a\n    t=a2(s−ut)​\n\n    ​\n\nSummary\n\n    Algebraic Fractions involve variables in the numerator, denominator, or both.\n    For Multiplication and Division, multiply across and simplify.\n    For Addition and Subtraction, find a common denominator, then add or subtract.\n    Manipulation of Algebraic Formulae is rearranging to isolate a desired variable."
      
 
}